open-vela/contest2026_135_yongwangzhiqian/app/bk7258/bk7258_preferences.c
/****************************************************************************
 * app/bk7258/bk7258_preferences.c
 *
 * SPDX-License-Identifier: Apache-2.0
 ****************************************************************************/

#include "bk7258_preferences.h"
#include "bk7258_preferences_storage.h"
#include <nuttx/config.h>
#ifdef CONFIG_BK7258_VOICE_VOLUME_PERSISTENCE
#include "bk7258_voice_volume_store.h"
#endif

#include <errno.h>
#include <stdio.h>
#include <string.h>

#include <kvdb.h>
#include <nuttx/mutex.h>

#define BK7258_PREFERENCES_VOLUME_KEY  "persist.shaniu.volume"
#define BK7258_PREFERENCES_PERSONA_KEY "persist.shaniu.persona"
#define BK7258_PREFERENCES_DEFAULT_VOLUME 50u

/* One owner serializes disk operations and publication of the last confirmed
 * volume. Playback can use this value while the shared medium is unavailable.
 */
static mutex_t g_preferences_lock = NXMUTEX_INITIALIZER;
static int g_playback_volume = -1;

int bk7258_preferences_with_storage(int (*operation)(void *), void *context)
{
  if (operation == NULL) return -EINVAL;
  int ret = nxmutex_lock(&g_preferences_lock);
  if (ret < 0) return ret;
  ret = bk7258_preferences_storage_begin();
  if (ret >= 0)
    {
      ret = bk7258_preferences_storage_end(operation(context));
    }
  nxmutex_unlock(&g_preferences_lock);
  return ret;
}

struct bk7258_persona_name_s
{
  enum bk7258_persona_e persona;
  const char *name;
};

static const struct bk7258_persona_name_s g_personas[] =
{
  { BK7258_PERSONA_GENTLE, "gentle" },
  { BK7258_PERSONA_PLAYFUL, "playful" },
  { BK7258_PERSONA_QUIET, "quiet" },
  { BK7258_PERSONA_SERIOUS, "serious" },
  { BK7258_PERSONA_TSUNDERE_LITE, "tsundere_lite" }
};

#ifndef CONFIG_BK7258_VOICE_VOLUME_PERSISTENCE
static int bk7258_preferences_parse_volume(const char *value,
                                           unsigned int *volume_percent)
{
  unsigned int result = 0;
  size_t index;

  if (value == NULL || value[0] == '\0')
    {
      return -EBADMSG;
    }

  for (index = 0; value[index] != '\0'; index++)
    {
      if (value[index] < '0' || value[index] > '9')
        {
          return -EBADMSG;
        }

      result = result * 10u + (unsigned int)(value[index] - '0');
      if (result > 100u)
        {
          return -ERANGE;
        }
    }

  *volume_percent = result;
  return 0;
}

#endif

static int bk7258_preferences_parse_persona(const char *name,
                                             enum bk7258_persona_e *persona)
{
  size_t index;

  if (name == NULL)
    {
      return -EINVAL;
    }

  for (index = 0; index < sizeof(g_personas) / sizeof(g_personas[0]);
       index++)
    {
      if (strcmp(name, g_personas[index].name) == 0)
        {
          *persona = g_personas[index].persona;
          return 0;
        }
    }

  return -EINVAL;
}

static int bk7258_preferences_read(const char *key, char value[PROP_VALUE_MAX])
{
  /* property_get() substitutes a default for every backend error, which
   * would make a damaged or unavailable DB look like first boot.  The KVDB
   * error-preserving public variant is therefore required here.
   */

  return property_get_with_err(key, value);
}

static int bk7258_preferences_read_all(struct bk7258_preferences_s *preferences)
{
  char value[PROP_VALUE_MAX];
  int ret;

  if (preferences == NULL)
    {
      return -EINVAL;
    }

  memset(preferences, 0, sizeof(*preferences));
#ifdef CONFIG_BK7258_VOICE_VOLUME_PERSISTENCE
  ret = bkvoice_volume_store_get(&preferences->volume_percent);
#else
  ret = bk7258_preferences_read(BK7258_PREFERENCES_VOLUME_KEY, value);
#endif
  if (ret == -ENOENT || ret == -ENODATA)
    {
      preferences->volume_percent = BK7258_PREFERENCES_DEFAULT_VOLUME;
      preferences->volume_is_default = true;
    }
  else if (ret < 0)
    {
      return ret;
    }
  else
    {
#ifndef CONFIG_BK7258_VOICE_VOLUME_PERSISTENCE
      ret = bk7258_preferences_parse_volume(value,
                                            &preferences->volume_percent);
      if (ret < 0)
        {
          return ret;
        }
#endif
    }

  ret = bk7258_preferences_read(BK7258_PREFERENCES_PERSONA_KEY, value);
  if (ret == -ENOENT || ret == -ENODATA)
    {
      preferences->persona = BK7258_PERSONA_GENTLE;
      preferences->persona_is_default = true;
      return 0;
    }

  if (ret < 0)
    {
      return ret;
    }

  return bk7258_preferences_parse_persona(value, &preferences->persona);
}

static int bk7258_preferences_get_locked(struct bk7258_preferences_s *preferences)
{
  struct bk7258_preferences_s result;
  int ret;

  if (preferences == NULL)
    {
      return -EINVAL;
    }

  ret = bk7258_preferences_storage_begin();
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_preferences_storage_end(bk7258_preferences_read_all(&result));
  if (ret >= 0)
    {
      *preferences = result;
      g_playback_volume = (int)result.volume_percent;
    }
  else
    {
      g_playback_volume = -1;
    }

  return ret;
}

int bk7258_preferences_get(struct bk7258_preferences_s *preferences)
{
  int ret;

  if (preferences == NULL)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&g_preferences_lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_preferences_get_locked(preferences);
  nxmutex_unlock(&g_preferences_lock);
  return ret;
}

int bk7258_preferences_playback_volume(unsigned int *volume_percent)
{
#ifdef CONFIG_BK7258_VOICE_VOLUME_PERSISTENCE
  if (volume_percent == NULL) return -EINVAL;
  int ret = bkvoice_volume_store_get(volume_percent);
  if (ret == -ENOENT || ret == -ENODATA)
    {
      *volume_percent = BK7258_PREFERENCES_DEFAULT_VOLUME;
      return 0;
    }
  return ret;
#else
  struct bk7258_preferences_s preferences;
  int ret;

  if (volume_percent == NULL)
    {
      return -EINVAL;
    }

  ret = nxmutex_lock(&g_preferences_lock);
  if (ret < 0)
    {
      return ret;
    }

  if (g_playback_volume < 0)
    {
      ret = bk7258_preferences_get_locked(&preferences);
    }

  if (ret >= 0)
    {
      *volume_percent = (unsigned int)g_playback_volume;
    }

  nxmutex_unlock(&g_preferences_lock);
  return ret;
#endif
}

static int bk7258_preferences_write(const char *key, const char *value,
                                   int volume_percent)
{
  int ret = nxmutex_lock(&g_preferences_lock);
  if (ret < 0)
    {
      return ret;
    }

  ret = bk7258_preferences_storage_begin();
  if (ret < 0)
    {
      nxmutex_unlock(&g_preferences_lock);
      return ret;
    }

  ret = property_set(key, value);
  if (ret >= 0)
    {
      ret = property_commit();
    }

  ret = bk7258_preferences_storage_end(ret);
  if (ret < 0)
    {
      /* A commit/cleanup error can mean the new value reached disk. */
      g_playback_volume = -1;
    }
  else if (volume_percent >= 0)
    {
      g_playback_volume = volume_percent;
    }

  nxmutex_unlock(&g_preferences_lock);
  return ret;
}

int bk7258_preferences_set_volume(unsigned int volume_percent)
{
#ifdef CONFIG_BK7258_VOICE_VOLUME_PERSISTENCE
  if (volume_percent > 100u) return -ERANGE;
  return bkvoice_volume_store_set(volume_percent);
#else
  char value[4];

  if (volume_percent > 100u)
    {
      return -ERANGE;
    }

  (void)snprintf(value, sizeof(value), "%u", volume_percent);
  return bk7258_preferences_write(BK7258_PREFERENCES_VOLUME_KEY, value,
                                  (int)volume_percent);
#endif
}

int bk7258_preferences_set_persona(const char *persona)
{
  enum bk7258_persona_e parsed;
  int ret;

  ret = bk7258_preferences_parse_persona(persona, &parsed);
  if (ret < 0)
    {
      return ret;
    }

  return bk7258_preferences_write(BK7258_PREFERENCES_PERSONA_KEY,
                                  bk7258_preferences_persona_name(parsed), -1);
}
